# Terminal
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"

# Editor
brew "neovim"

# Multiplexer (already installed but listed for portability)
brew "tmux"

# Mouseless toolkit
brew "ripgrep"      # rg
brew "fd"           # fast find
brew "fzf"          # fuzzy finder
brew "zoxide"       # smarter cd (z)
brew "bat"          # better cat
brew "eza"          # better ls
brew "git-delta"    # nicer diffs
brew "lazygit"      # tui git
brew "gh"           # github cli
brew "jq"           # json
brew "yq"           # yaml
brew "tldr"         # short man pages
brew "htop"
brew "btop"
brew "tree"
brew "wget"
